iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G071/targetInit/stm32g0_sfr.h
};

#define TIM6_0 (*(volatile struct TIM6_0_tag *) 0x40001000)

struct TIM7_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
      uint64_t UDIS:1;
      uint64_t URS:1;
      uint64_t OPM:1;
      uint64_t reservedSpace0:3;
      uint64_t ARPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t MMS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIE:1;
      uint64_t reservedSpace0:7;
      uint64_t UDE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EGR;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARR;

};

#define TIM7_0 (*(volatile struct TIM7_0_tag *) 0x40001400)

struct Ethernet_MAC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t DC:1;
      uint64_t BL:2;
      uint64_t APCS:1;
      uint64_t reservedSpace1:1;
      uint64_t RD:1;
      uint64_t IPCO:1;
      uint64_t DM:1;
      uint64_t LM:1;
      uint64_t ROD:1;
      uint64_t FES:1;
      uint64_t reservedSpace2:1;
      uint64_t CSD:1;
      uint64_t IFG:3;
      uint64_t reservedSpace3:2;
      uint64_t JD:1;
      uint64_t WD:1;
      uint64_t reservedSpace4:1;
      uint64_t CSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PM:1;
      uint64_t HU:1;
      uint64_t HM:1;
      uint64_t DAIF:1;
      uint64_t RAM:1;
      uint64_t BFD:1;
      uint64_t PCF:1;
      uint64_t SAIF:1;
      uint64_t SAF:1;
      uint64_t HPF:1;
      uint64_t reservedSpace0:21;
      uint64_t RA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACFFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHTHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACHTLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MB:1;
      uint64_t MW:1;
      uint64_t CR:3;
      uint64_t reservedSpace0:1;
      uint64_t MR:5;
      uint64_t PA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMIIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACMIIDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCB:1;
      uint64_t TFCE:1;
      uint64_t RFCE:1;
      uint64_t UPFD:1;
      uint64_t PLT:2;
      uint64_t reservedSpace0:1;
      uint64_t ZQPD:1;
      uint64_t reservedSpace1:8;
      uint64_t PT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACFCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VLANTI:16;
      uint64_t VLANTC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACVLANTR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PD:1;
      uint64_t MPE:1;
      uint64_t WFE:1;
      uint64_t reservedSpace0:2;
      uint64_t MPR:1;
      uint64_t WFR:1;
      uint64_t reservedSpace1:2;
      uint64_t GU:1;
      uint64_t reservedSpace2:21;
      uint64_t WFFRPR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACPMTCSR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CR:1;
      uint64_t CSR:1;
      uint64_t ROR:1;
      uint64_t MCF:1;
      uint64_t MCP:1;
      uint64_t MCFHP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACDBGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTS:1;
      uint64_t MMCS:1;
      uint64_t MMCRS:1;
      uint64_t MMCTS:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PMTIM:1;
      uint64_t reservedSpace1:5;
      uint64_t TSTIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACIMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA0H:16;
      uint64_t reservedSpace0:15;
      uint64_t MO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA0L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA0LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA1H:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA1LR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA1LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAC2AH:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA2L:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA2LR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACA3H:16;
      uint64_t reservedSpace0:8;
      uint64_t MBC:6;
      uint64_t SA:1;
      uint64_t AE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3HR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBCA3L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MACA3LR;

