iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32G071/targetInit/stm32g0_sfr.h
};

#define FLASH_2 (*(volatile struct FLASH_2_tag *) 0x40022000)

struct DBG_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEV_ID:16;
      uint64_t REV_ID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DBG_STOP:1;
      uint64_t DBG_STANDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBG_TIMER2_STOP:1;
      uint64_t DBG_TIM3_STOP:1;
      uint64_t reservedSpace0:2;
      uint64_t DBG_TIMER6_STOP:1;
      uint64_t DBG_TIM7_STOP:1;
      uint64_t reservedSpace1:4;
      uint64_t DBG_RTC_STOP:1;
      uint64_t DBG_WWDG_STOP:1;
      uint64_t DBG_IWDG_STOP:1;
      uint64_t reservedSpace2:8;
      uint64_t DBG_I2C1_STOP:1;
      uint64_t reservedSpace3:8;
      uint64_t DBG_LPTIM2_STOP:1;
      uint64_t DBG_LPTIM1_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB_FZ1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:11;
      uint64_t DBG_TIM1_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t DBG_TIM14_STOP:1;
      uint64_t DBG_TIM15_STOP:1;
      uint64_t DBG_TIM16_STOP:1;
      uint64_t DBG_TIM17_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB_FZ2;

};

#define DBG_2 (*(volatile struct DBG_2_tag *) 0x40015800)

struct RCC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t HSION:1;
      uint64_t HSIKERON:1;
      uint64_t HSIRDY:1;
      uint64_t HSIDIV:3;
      uint64_t reservedSpace1:2;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSON:1;
      uint64_t reservedSpace2:4;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSICAL:8;
      uint64_t HSITRIM:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:3;
      uint64_t SWS:3;
      uint64_t reservedSpace0:2;
      uint64_t HPRE:4;
      uint64_t PPRE:3;
      uint64_t reservedSpace1:9;
      uint64_t MCOSEL:3;
      uint64_t reservedSpace2:1;
      uint64_t MCOPRE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PLLSRC:2;
      uint64_t reservedSpace0:2;
      uint64_t PLLM:3;
      uint64_t reservedSpace1:1;
      uint64_t PLLN:7;
      uint64_t reservedSpace2:1;
      uint64_t PLLPEN:1;
      uint64_t PLLP:5;
      uint64_t reservedSpace3:2;
      uint64_t PLLQEN:1;
      uint64_t PLLQ:3;
      uint64_t PLLREN:1;
      uint64_t PLLR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSYSCFGR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLSYSRDYIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLSYSRDYF:1;
      uint64_t reservedSpace1:2;
      uint64_t CSSF:1;
      uint64_t LSECSSF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t reservedSpace0:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLSYSRDYC:1;
      uint64_t reservedSpace1:2;
      uint64_t CSSC:1;
      uint64_t LSECSSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPARST:1;
      uint64_t IOPBRST:1;
      uint64_t IOPCRST:1;
      uint64_t IOPDRST:1;
      uint64_t reservedSpace0:1;
      uint64_t IOPFRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMARST:1;
      uint64_t reservedSpace0:7;
      uint64_t FLASHRST:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCRST:1;
      uint64_t reservedSpace2:3;
      uint64_t AESRST:1;
      uint64_t reservedSpace3:1;
      uint64_t RNGRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t reservedSpace0:2;
      uint64_t TIM6RST:1;
      uint64_t TIM7RST:1;
      uint64_t reservedSpace1:8;
      uint64_t SPI2RST:1;
      uint64_t reservedSpace2:2;
      uint64_t USART2RST:1;
      uint64_t USART3RST:1;
      uint64_t USART4RST:1;
      uint64_t LPUART1RST:1;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t reservedSpace3:1;
      uint64_t CECRST:1;
      uint64_t UCPD1RST:1;
      uint64_t UCPD2RST:1;
      uint64_t DBGRST:1;
      uint64_t PWRRST:1;
      uint64_t DAC1RST:1;
      uint64_t LPTIM2RST:1;
      uint64_t LPTIM1RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBRSTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1RST:1;
      uint64_t SPI1RST:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1RST:1;
      uint64_t TIM14RST:1;
      uint64_t TIM15RST:1;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace2:1;
      uint64_t ADCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBRSTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPAEN:1;
      uint64_t IOPBEN:1;
      uint64_t IOPCEN:1;
      uint64_t IOPDEN:1;
      uint64_t reservedSpace0:1;
      uint64_t IOPFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:7;
      uint64_t FLASHEN:1;
      uint64_t reservedSpace1:3;
      uint64_t CRCEN:1;
      uint64_t reservedSpace2:3;
      uint64_t AESEN:1;
      uint64_t reservedSpace3:1;
      uint64_t RNGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t reservedSpace0:2;
      uint64_t TIM6EN:1;
      uint64_t TIM7EN:1;
      uint64_t reservedSpace1:4;
      uint64_t RTCAPBEN:1;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace3:2;
      uint64_t USART2EN:1;
      uint64_t USART3EN:1;
      uint64_t USART4EN:1;
      uint64_t LPUART1EN:1;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t reservedSpace4:1;
      uint64_t CECEN:1;
      uint64_t UCPD1EN:1;
      uint64_t UCPD2EN:1;
      uint64_t DBGEN:1;
      uint64_t PWREN:1;
      uint64_t DAC1EN:1;
      uint64_t LPTIM2EN:1;
      uint64_t LPTIM1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1EN:1;
      uint64_t TIM14EN:1;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace2:1;
      uint64_t ADCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IOPASMEN:1;
      uint64_t IOPBSMEN:1;
      uint64_t IOPCSMEN:1;
      uint64_t IOPDSMEN:1;
      uint64_t reservedSpace0:1;
      uint64_t IOPFSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOPSMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMASMEN:1;
      uint64_t reservedSpace0:7;
      uint64_t FLASHSMEN:1;
      uint64_t SRAMSMEN:1;
      uint64_t reservedSpace1:2;
      uint64_t CRCSMEN:1;
      uint64_t reservedSpace2:3;
      uint64_t AESSMEN:1;
      uint64_t reservedSpace3:1;
      uint64_t RNGSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBSMENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2SMEN:1;
      uint64_t TIM3SMEN:1;
      uint64_t reservedSpace0:2;
      uint64_t TIM6SMEN:1;
      uint64_t TIM7SMEN:1;
      uint64_t reservedSpace1:4;
      uint64_t RTCAPBSMEN:1;
      uint64_t WWDGSMEN:1;
      uint64_t reservedSpace2:2;
      uint64_t SPI2SMEN:1;
      uint64_t reservedSpace3:2;
      uint64_t USART2SMEN:1;
      uint64_t USART3SMEN:1;
      uint64_t USART4SMEN:1;
      uint64_t LPUART1SMEN:1;
      uint64_t I2C1SMEN:1;
      uint64_t I2C2SMEN:1;
      uint64_t reservedSpace4:1;
      uint64_t CECSMEN:1;
      uint64_t UCPD1SMEN:1;
      uint64_t UCPD2SMEN:1;
      uint64_t DBGSMEN:1;
      uint64_t PWRSMEN:1;
      uint64_t DAC1SMEN:1;
      uint64_t LPTIM2SMEN:1;
      uint64_t LPTIM1SMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBSMENR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGSMEN:1;
      uint64_t reservedSpace0:10;
      uint64_t TIM1SMEN:1;
      uint64_t SPI1SMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t USART1SMEN:1;
      uint64_t TIM14SMEN:1;
      uint64_t TIM15SMEN:1;
      uint64_t TIM16SMEN:1;
      uint64_t TIM17SMEN:1;
      uint64_t reservedSpace2:1;
      uint64_t ADCSMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APBSMENR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1SEL:2;
      uint64_t USART2SEL:2;
      uint64_t reservedSpace0:2;
      uint64_t CECSEL:1;
      uint64_t reservedSpace1:3;
      uint64_t LPUART1SEL:2;
      uint64_t I2C1SEL:2;
      uint64_t I2S2SEL:2;
      uint64_t reservedSpace2:2;
      uint64_t LPTIM1SEL:2;
      uint64_t LPTIM2SEL:2;
      uint64_t TIM1SEL:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM15SEL:1;
      uint64_t reservedSpace4:1;
      uint64_t RNGSEL:2;
      uint64_t RNGDIV:2;
      uint64_t ADCSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCIPR;

